"Volume" = "Äänenvoimakkuus"; 
"Drawbars" = "Vetosäätimet"; 
"Percussion Level" = "Perkussiotaso"; 
"Percussion Time" = "Perkussioaika"; 
"Click" = "Metron."; 
"Distortion" = "Särö"; 
"Rotary Speaker" = "Pyörivä kaiutin"; 


